quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190718.C
#include "BQ26100Slave.H"	

#include "stm32f10x_exti.h"

#include "STM32_TIM.H"
#include "STM32_EXTI.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"

#include "STM32F10x_BitBand.H"

#include 	"CRC.H"

#include "BQ26100DATA.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间

#define	BQ26100slavePort					GPIOA
#define	BQ26100slavePin						GPIO_Pin_6

#define	SetBQ26100slavePinLevel		PA6
#define	GetBQ26100slavePinLevel		PA6in

#define	SetBQ26100slavePinOut		{	GPIOA->CRL&=0xF0FFFFFF;\
																	GPIOA->CRL|=0x07000000;\
																/*SetBQ26100slavePinLevel=0;*/}		//配置为OD输出模式并拉低
													
#define	SetBQ26100slavePinIntrr	{	GPIOA->CRL&=0xF0FFFFFF;\
																	GPIOA->CRL|=0x08000000;\
																	/*SetBQ26100slavePinLevel=1;*/}			//配置为上拉输入模式


bq26100slave_def* SDQ_SAMPLE=0;
RCC_ClocksTypeDef bqRCC_ClocksStatus;				//时钟状态---时钟值


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100slave_configuration(bq26100slave_def *sSDQ)		//SDQ从机设备配置
{
	SDQ_SAMPLE	=	sSDQ;
	EXTI_Configuration_ITF(BQ26100slavePort, BQ26100slavePin);		//外部边沿触发中断配置,抢占1，响应1--20171213	
	
	RCC_GetClocksFreq(&bqRCC_ClocksStatus);		//获取时钟参数
	SDQ_SAMPLE->time.timeper=bqRCC_ClocksStatus.SYSCLK_Frequency/8000000;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100slave_server(void)		//SDQ从机设备服务
{
	static unsigned short time = 0;
	//====================有错误
	if(api_bq26100slave_get_error_status())		//无错误返回0，有错误返回1
	{
		if(time++>1000)
		{
			api_bq26100slave_reset_error_status();
		}
	}
	else
	{
		time = 0;
	}
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_process(void)
{
	//unsigned long fitime=0;
	//----滤波
	SDQ_SAMPLE->time.time1=SysTick_ReLoad();			//设置SYSTICK初始值
	SDQ_SAMPLE->data.intrrcout++;									//中断次数计数
	if(0==GetBQ26100slavePinLevel)													//低电平
	{
		unsigned char bit=0;
		//========================位接收:启动或者干扰滤波处理
		bit=api_bq26100slave_receive_bit();
		if(0xFF==bit)
		{
			api_bq26100slave_start();
			api_bq26100slave_default();
			return 1;
		}
		else if(0x80==bit)
		{
			//SDQ_SAMPLE->data.receivelen=0;
			return 1;
		}
		//========================数据传输
		//------------------------bit有效信号:主机写0、1或者启动bit位读,读数据时bit只能为1
		else if(4>SDQ_SAMPLE->data.receivelen)
		{
			api_bq26100slave_Initialize(bit);
		}
		else
		{
			//api_bq26100slave_command_process(bit);
			if(0==api_bq26100slave_command_process(bit))
			{
				api_bq26100slave_default();
			}
		}
	}
	return 0;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_Initialize(unsigned char bit)
{
	//------------------------每次命令先传rom、ram、地址低位、地址高位
	//---------------------等待接收完一字节
	if(1==api_bq26100slave_receive_byte(bit))	//未接收完一字节
	{
		//-------------------获取ROM命令
		if(1==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->RomCmd	=	(sdq_rom_cmd)SDQ_SAMPLE->data.receive[0];
		}
		//-------------------获取RAM命令
		else if(2==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->MemCmd	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[1];
			//api_bq26100slave_MenCmd();
		}
		//-------------------获取地址低字节
		else if(3==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->data.addressL	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[2];
		}
		//-------------------获取地址高字节
		else if(4==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->data.addressH	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[3];
			api_bq26100slave_MenCmd();
		}
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_command_process(unsigned char bit)
{
	//========================数据接收或者读取:发送CRC，message原值、status、digest
	//------------------主机写消息
	if(sdq_mem_write_message==SDQ_SAMPLE->MemCmd)
	{
		api_bq26100slave_write_message(bit);
		return 1;
	}
	//------------------主机读摘要
	else if((sdq_mem_read_digest==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		return api_bq26100slave_read_digest(bit);
	}
	//------------------主机读控制寄存器
	else if((sdq_mem_read_control==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		return api_bq26100slave_read_control(bit);
	}
	//------------------主机写控制寄存器
	else if((sdq_mem_write_control==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		return api_bq26100slave_write_control(bit);
	}
	return 1;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_MenCmd(void)
{
	//------------------主机写消息
	if(sdq_mem_write_message==SDQ_SAMPLE->MemCmd)
	{
		//---------------Message
		SDQ_SAMPLE->data.Message.MessageLen	=	0;
		//---------------
		SDQ_SAMPLE->status					=	sdq_master_write;
		//---------------
		SDQ_SAMPLE->data.CtlFlag		=	0;
		//---------------
		SDQ_SAMPLE->data.Digest.Serial	=	0;
		
		
		//---------------Digest
		SDQ_SAMPLE->data.Digest.Flag.Auth	=	0;
		//---------------Ctrl
		SDQ_SAMPLE->data.Ctrl.Read.Times	=	0;
		
		SDQ_SAMPLE->data.Ctrl.Flag.Start	=	0;
	}
	//------------------主机读摘要
	else if(sdq_mem_read_digest==SDQ_SAMPLE->MemCmd)
	{		
		SDQ_SAMPLE->status							=	sdq_master_readCRC;
		SDQ_SAMPLE->data.Digest.Flag.Start	=	0;
		SDQ_SAMPLE->data.Digest.Serial	=	0;
	}
	//------------------主机读控制寄存器
	else if(sdq_mem_read_control==SDQ_SAMPLE->MemCmd)
	{
		SDQ_SAMPLE->data.Ctrl.Read.Serial	=	0;
		SDQ_SAMPLE->status					=	sdq_master_readCRC;
	}
	//------------------主机写控制寄存器
	else if(sdq_mem_write_control==SDQ_SAMPLE->MemCmd)
	{		
		SDQ_SAMPLE->data.Ctrl.Write.Serial	=	0;
		SDQ_SAMPLE->data.Ctrl.Flag.Start		=	0;
		
		//---------------Digest
		SDQ_SAMPLE->data.Digest.Flag.Auth	=	1;
		
		SDQ_SAMPLE->status									=	sdq_master_write;
	}
	
	//SDQ_SAMPLE->data.SendBitLen	=	0;
	return 1;
}
//------------------------------------------------------------------------------



