quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190718.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_read_digest(unsigned char bit)
{
	if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
	{
		return 0;
	}		
	//====================第一步:主机读取RAM命令和两字节地址校验
	if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(0==SDQ_SAMPLE->data.Digest.Flag.Start)
		{
			//---------------------RAM命令和两字节地址校验
			SDQ_SAMPLE->data.SendByte	=		CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);
			SDQ_SAMPLE->data.Digest.Flag.Start	=	1;
		}
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{				
			//SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.message[SDQ_SAMPLE->data.messgaelen-1];
			SDQ_SAMPLE->status	=	sdq_master_read;
			SDQ_SAMPLE->data.Digest.Flag.Start	=	0;
		}
		return 1;
	}
	//====================第二步:返回消息摘要
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		//----------------未启动传输
		if(0==SDQ_SAMPLE->data.Digest.Flag.Start)		//未设置消息
		{	
			//--------------第一次返回摘要为原message消息----未设置控制位
			if(0==SDQ_SAMPLE->data.Digest.Flag.Auth)		//未启动转换:发回message
			{
				memcpy(SDQ_SAMPLE->data.Digest.Buffer,SDQ_SAMPLE->data.Message.Buffer,20);
			}
			//--------------第二次返回摘要为转换后的摘要消息--已设置控制位，如果未匹配到摘要则做异常处理
			else
			{
				unsigned short i = 0;
				for(i=0;i<sdq_sample_size;i++)
				{
					if(0==memcmp(SDQ_SAMPLE->data.Message.Buffer,bq26100_sample_data[i][0],20))
					{
						memcpy(SDQ_SAMPLE->data.Digest.Buffer,bq26100_sample_data[i][1],20);
						break;
					}
				}
				//------------------------未匹配到数据
				if(i>=sdq_sample_size)
				{
					api_bq26100slave_digest_match_error();
					return 0;
				}
			}
			//--------------启动发送
			SDQ_SAMPLE->data.Digest.Flag.Start	=	1;
			SDQ_SAMPLE->data.Digest.Serial			=	0;
			SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Digest.Buffer[SDQ_SAMPLE->data.Digest.Serial];				
		}
		//----------------已启动传输
		//===========================发送数据
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{				
			//SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.message[SDQ_SAMPLE->data.messgaelen-1];
			SDQ_SAMPLE->data.Digest.Serial	+=	1;		//已发送数量计数
			if(20>SDQ_SAMPLE->data.Digest.Serial)
			{
				SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Digest.Buffer[SDQ_SAMPLE->data.Digest.Serial];
			}
			//--------------发送所有的Digest数据校验
			else if(20==SDQ_SAMPLE->data.Digest.Serial)
			{
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(SDQ_SAMPLE->data.Digest.Buffer,20);
			}
			else	//发送完摘要和CRC
			{
				SDQ_SAMPLE->status							=	sdq_ilde;
				return 1;
			}					
		}
		SDQ_SAMPLE->status					=	sdq_master_read;
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_write_message(unsigned char bit)
{
	//====================第一步:主机写数据
	if(sdq_master_write	==	SDQ_SAMPLE->status)
	{
		if(1==api_bq26100slave_receive_byte(bit))	//未接收完一字节
		{
			if(20>SDQ_SAMPLE->data.Message.MessageLen)	//message合法字节数据只能为20
			{
				SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen]	=	SDQ_SAMPLE->data.RcvByte;
				SDQ_SAMPLE->data.Message.MessageLen		+=	1;
				
				//----------------主机发送完第一字节message后需要读取"RAM命令和两字节地址长度和数据"校验
				if(1==SDQ_SAMPLE->data.Message.MessageLen)
				{					
					SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],SDQ_SAMPLE->data.receivelen-1);
				}
				//----------------主机发完第二条message后的校验方式:当前地址与当前数据异或出结果再求对应结果的CRC
				else
				{
					unsigned char temp=(SDQ_SAMPLE->data.Message.MessageLen-1)^SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen-1];
					SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&temp,1);
				}
				//----------------主机每发送完一字节数据后需要读取CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;				
				return 1;
			}
			//协议失败:发送数据个数超过20个字节
			else
			{
			}
			return 0;		//协议失败:发送数据个数超过20个字节
		}
		return 1;
	}
	//====================主机读CRC和数据时，启动bit只能为1
	//====================第二步:主机读CRC，主机读完CRC后读回原字节数据
	else if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
		{
			return 0;
		}
		else
		{
			if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
			{
				SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen-1];
				SDQ_SAMPLE->status	=	sdq_master_read;
				return 1;
			}
		}
	}
	//====================第三步:主机读回数据,读回数据后主机继续发送下一字节数据，直到主机发送完20个字节
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
		{
			return 0;
		}
		else
		{
			if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
			{
				if(20	<=	SDQ_SAMPLE->data.Message.MessageLen)
				{
					SDQ_SAMPLE->status	=	sdq_ilde;						//空闲:主机发送完所有的message
				}
				else
				{
					SDQ_SAMPLE->status	=	sdq_master_write;		//主机继续发送下一字节数据
				}
			}
			return 1;
		}
	}
	return 0;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_read_control(unsigned char bit)
{
	//----------------第一步:上传RAM,AddressL,AddressH校验
	//----------------第二步:上传00地址状态值
	//----------------第三步:上传01地址状态值
	//----------------第四步:上传(RAM,AddressL,AddressH)&(RAM,AddressL,AddressH校验结果)&(00地址内容)&(01地址内容)的CRC校验
	if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
	{
		return 0;
	}	
	//====================第一步:主机读取RAM命令和两字节地址校验
	if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(0==SDQ_SAMPLE->data.Ctrl.Flag.Start)
		{
			//---------------------RAM命令和两字节地址校验
			if(0	==	SDQ_SAMPLE->data.Ctrl.Read.Times)
			{				
				SDQ_SAMPLE->data.Ctrl.Read.CrcData	=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);				
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl0		=	0x04;
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl1		=	0xA1;
			}
			else if(1	==	SDQ_SAMPLE->data.Ctrl.Read.Times)
			{				
				SDQ_SAMPLE->data.Ctrl.Read.CrcData	=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl0		=	0x06;
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl1		=	0xA1;
			}
			SDQ_SAMPLE->data.SendByte						=	SDQ_SAMPLE->data.Ctrl.Read.CrcData;
			SDQ_SAMPLE->data.Ctrl.Flag.Start		=	1;
		}
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{	
			if(0 == SDQ_SAMPLE->data.Ctrl.Read.Serial)		//未传输数据
			{
				SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl0;
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			else if(2 == SDQ_SAMPLE->data.Ctrl.Read.Serial)	//发送完最后一个CRC
			{
				SDQ_SAMPLE->status	=	sdq_ilde;
				SDQ_SAMPLE->data.Ctrl.Flag.Start	=	0;
				SDQ_SAMPLE->data.Ctrl.Read.Times	+=1;
			}
		}
		return 1;
	}
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		if(1==api_bq26100slave_send_byte())			//返回1表示发送完一字节
		{	
			SDQ_SAMPLE->data.Ctrl.Read.Serial	+=1;
			if(1 == SDQ_SAMPLE->data.Ctrl.Read.Serial)
			{
				SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl1;
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			else if(2 == SDQ_SAMPLE->data.Ctrl.Read.Serial)
			{
				unsigned char buffer[6]={0};
				memcpy(buffer,&SDQ_SAMPLE->data.receive[1],3);
				buffer[3]	=	SDQ_SAMPLE->data.Ctrl.Read.CrcData;
				buffer[4]	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl0;
				buffer[5]	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl1;
				SDQ_SAMPLE->data.SendByte	=	CRC8_8541_lsb(buffer,6);
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
		}
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------



