quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190718.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_write_control(unsigned char bit)
{
	//====================第一步:主机写数据
	if(sdq_master_write	==	SDQ_SAMPLE->status)
	{
		//------------------第一步:接收第一个数据
		if(1==api_bq26100slave_receive_byte(bit))	//未接收完一字节
		{
			SDQ_SAMPLE->data.Ctrl.Write.Serial+=1;
			//------------------主机发完第一个状态寄存器：下一步返回CRC
			if(1 == SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------主机发送第一个字节
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl0R	=	SDQ_SAMPLE->data.RcvByte;				
				//----------------从机需要返回的状态值
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl0T	=	0x06;
				//----------------主机发送完第一字节控制寄存器值后需要读取"RAM命令和两字节地址长度和数据"校验
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],SDQ_SAMPLE->data.receivelen-1);
				//----------------下一条操作为向主机返回CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
			//------------------主机发完第二个状态寄存器：下一步返回CRC
			else if(2 == SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				unsigned char temp	=	0;
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl1	=	SDQ_SAMPLE->data.RcvByte;
				//----------------当前地址与当前数据异或出结果再求对应结果的CRC
				temp	=	0x01^SDQ_SAMPLE->data.Ctrl.Write.Ctrl1;
				//----------------获取CRC
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&temp,1);
				//----------------下一条操作为向主机返回CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
			return 1;
		}
	}
	//====================向主机返回CRC
	//--------------------第一步返回CRC：原状态为向主机发送CRC，下一步为向主机发送控制寄存器状态
	else if(sdq_master_readCRC==SDQ_SAMPLE->status)
	{
		if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
		{
			return 0;
		}
		//----------------------发送CRC
		else
		{
			if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
			{
				//------------------主机读完第一个CRC：下一步读取第一个状态寄存器值
				if(1 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
				{
					//----------------控制寄存器0的值
					SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Ctrl.Write.Ctrl0T;
					//----------------等待主机读取数据
					SDQ_SAMPLE->status	=	sdq_master_read;
				}
				//------------------主机读完第二个状态值的CRC：下一步读取第二个状态寄存器
				else if(2 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
				{
					//----------------控制寄存器0的值
					SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Ctrl.Write.Ctrl1;
					//----------------等待主机读取数据
					SDQ_SAMPLE->status	=	sdq_master_read;
				}
				//------------------
				else
				{
					SDQ_SAMPLE->status	=	sdq_ilde;		//主机继续发送下一字节数据
				}
				return 1;
			}
			return 1;
		}
		return 1;
	}
	//====================第三步:返回寄存器值
	else if(sdq_master_read==SDQ_SAMPLE->status)
	{
		if(1	!=	bit)	//信号出错:主机启动读信号时传入的bit只能为1
		{
			return 0;
		}
		//----------------------发送数据
		else
		{
			if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
			{
				//------------------主机读完第一个状态寄存器：下一步主机发送第二个状态寄存器值
				if(1 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
				{
					//----------------等待主机发送寄存器1数据
					SDQ_SAMPLE->status	=	sdq_master_write;
				}
				//------------------主机读完第二个状态寄存器：完成整个写控制寄存器操作
				else if(2 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
				{
					//----------------等待主机发送寄存器1数据：完成
					SDQ_SAMPLE->status	=	sdq_ilde;
				}
			}
		}
	}
	return 1;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_digest_match_error(void)
{
	SDQ_SAMPLE->status	=	sdq_error;
	//api_bq26100slave_default();
	return 0;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_get_error_status(void)
{
	//==================无错误:返回0
	if(sdq_error !=	SDQ_SAMPLE->status)
	{
		return 0;
	}
	//==================有错误:返回1
	else
	{
		return 1;
	}
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_reset_error_status(void)
{
	SDQ_SAMPLE->status	=	sdq_ilde;
	return 1;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_send_bit(unsigned char bit)
{	
	SetBQ26100slavePinOut;
	SetBQ26100slavePinLevel	=	bit;
	SysTick_DeleyuS(50);				//SysTick延时nuS
	SetBQ26100slavePinIntrr;
	return 1;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_receive_bit(void)
{
	unsigned char flag=0;
	//-----------------主机写数据或者空闲状态时
	if((sdq_start==SDQ_SAMPLE->status)||(sdq_ilde==SDQ_SAMPLE->status)||(sdq_master_write==SDQ_SAMPLE->status))
	{
		SDQ_SAMPLE->time.count=0;
		SDQ_SAMPLE->time.time_sys=0;	
		while(0==GetBQ26100slavePinLevel)
		{
			if(SysTick_GetVal()<2)
			{
				if(0==flag)
				{
					flag=1;
					SDQ_SAMPLE->time.time_sys+=1;
					break;
				}
			}
			else
			{
				flag=0;
			}
		}
		SDQ_SAMPLE->time.time2=SysTick_GetVal();							//获取当前SysTick计数值
		
