quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190718.C
		//------开始前时间少于500，去掉一次计数
		//------计算时长:9000为SYSTICK设置为1us时的重装载值
		
		SDQ_SAMPLE->time.time_sys=SDQ_SAMPLE->time.time_sys*9000+SDQ_SAMPLE->time.time1-SDQ_SAMPLE->time.time2;

		//------转换为us
		SDQ_SAMPLE->time.count=SDQ_SAMPLE->time.time_sys/SDQ_SAMPLE->time.timeper;
		
		//------
		//------启动条件：主机拉低信号480us-960us
		if(SDQ_SAMPLE->time.count>350)
		{	
			return 0xFF;
		}
		//------主机写0:拉低信号60us-120us
		else if(SDQ_SAMPLE->time.count>50)
		{
			return 0;
		}
		//------主机写1或者启动bit位读:拉低信号大于1us，总时间60us
		else if((SDQ_SAMPLE->time.count<15))
		{
			return 1;
		}
	}
	//-----------------主机读(CRC或者数据)
	else
	{
//		while(0==GetBQ26100slavePinLevel)
//		{
//			//-------------连续低电平超过3us(1ms重装值为9000)
//			//-------------2us为18(8982-9000-2*9)
//			if(SysTick_GetVal()<8990)
//			{
//				return 1;
//			}
//		}
		return 1;
	}
	return 0x80;		//其它未识别时间
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_send_byte(void)
{	
	api_bq26100slave_send_bit(SDQ_SAMPLE->data.SendByte&0x01);
	
	//=======================右移一位:低位先传
	SDQ_SAMPLE->data.SendByte		>>=	1;
	//=======================传输计数
	SDQ_SAMPLE->data.SendBitLen	+=	1;
	
	if(8<=SDQ_SAMPLE->data.SendBitLen)
	{
		SDQ_SAMPLE->data.SendBitLen	=	0;
		return 1;		//发送完一字节数据
	}	
	return 0;		//未发送完
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_receive_byte(unsigned char bit)
{
	//--------------------右移1位:低位先传输
	SDQ_SAMPLE->data.RcvByte>>=1;
	if(0==bit)
	{		
		SDQ_SAMPLE->data.RcvByte&=0x7F;		
	}
	else if(1==bit)
	{
		SDQ_SAMPLE->data.RcvByte|=0x80;		
	}
	
	//--------------------字节接收计数
	SDQ_SAMPLE->data.RcvBitlen+=1;
	//--------------------判断数据有无接收完一字节
	if(8<=SDQ_SAMPLE->data.RcvBitlen)
	{
		SDQ_SAMPLE->data.RcvBitlen	=	0;
		//========================将接收到的数据保存	
		if(SDQ_SAMPLE->data.receivelen<sdq_receive_buffer_size)
		{
			SDQ_SAMPLE->data.receive[SDQ_SAMPLE->data.receivelen]=SDQ_SAMPLE->data.RcvByte;
			SDQ_SAMPLE->data.receivelen+=1;
			return 1;		//接收完一字节
		}
		//------------------------缓存满
		else
		{
			return 0;
		}		
	}
	return 0;			//未接收完
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_start(void)
{	
	//------启动条件：主机拉低信号480us-960us
	//------等待15us-60us后从机拉低总线60us-240us作为对主机的应答
	SetBQ26100slavePinOut;
	SetBQ26100slavePinLevel=1;
	SysTick_DeleyuS(20);				//SysTick延时nuS
	SetBQ26100slavePinLevel=0;
	SysTick_DeleyuS(100);				//SysTick延时nuS
	SetBQ26100slavePinIntrr;
	
	return 1;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char  api_bq26100slave_default(void)
{
//	//----------------time
//	SDQ_SAMPLE->time.high	=	0;
//	SDQ_SAMPLE->time.low	=	0;	
	
	//----------------data
	//SDQ_SAMPLE->data.intrrcout=0;
	SDQ_SAMPLE->data.startcout++;
	SDQ_SAMPLE->data.receivelen=0;
	SDQ_SAMPLE->data.addressL	=	0;
	SDQ_SAMPLE->data.addressH	=	0;
	//SDQ_SAMPLE->data.SendBitLen	=	0;
	SDQ_SAMPLE->data.SendByte	=	0;
	SDQ_SAMPLE->data.RcvBitlen	=	0;
	SDQ_SAMPLE->data.RcvByte	=	0;

	
	//---------------Message
	//SDQ_SAMPLE->data.Message.MessageLen=0;
	
	//---------------Digest
	SDQ_SAMPLE->data.Digest.Serial=0;	
	
	//----------------RomCmd
	SDQ_SAMPLE->RomCmd	=	sdq_rom_idle;
	
	//----------------MemCmd
	SDQ_SAMPLE->MemCmd	=	sdq_mem_idle;
	
	//----------------status
	SDQ_SAMPLE->status	=	sdq_start;
	return 1;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void EXTI9_5_IRQHandler(void)
{
	EXTI_ClearITPendingBit(EXTI_Line6);
	//=======================高电平:上升沿
	if(0==GetBQ26100slavePinLevel)	//低电平
	{		
		api_bq26100slave_process();
	}
	//=======================低电平:下降沿
	else
	{
		//----------启动总线
		//if(SDQ_SAMPLE->time.count>1000)
		//{
			//SDQ_SAMPLE->status=sdq_start;
		//}
	}
	EXTI_ClearITPendingBit(EXTI_Line6);
	//EXTI_ClearITPendingBit(EXTI_Line6);
}



